num_Month = input("Введите номер месяца: ")

while not num_Month.isdigit() or int(num_Month) > 12 or int(num_Month) == 0:  # проверка ввода
    num_Month = input("Вы ввели некорректное значение.\nВведите целое, положительное число, меньше 12: ")
num_Month = int(num_Month)

season_List = ["Зима", "Зима", "Весна",
               "Весна", "Весна", "Лето",
               "Лето", "Лето", "Осень",
               "Осень", "Осень", "Зима"]

print("Сезон полученный через использование списка: ", season_List[num_Month-1])

season_Dict = {1: "Зима", 2: "Зима", 3: "Весна",
               4: "Весна", 5: "Весна", 6: "Лето",
               7: "Лето", 8: "Лето", 9: "Осень",
               10: "Осень", 11: "Осень", 12: "Зима"}

print("Сезон полученный через использование словаря: ", season_Dict.get(num_Month))
